8BitMixtape/8BitMixtapePlatform/avr/boards.txt
menu.bootloader=Bootloader
menu.core=Core

menu.chip=Chip
menu.clock=Clock
menu.bod=B.O.D.
menu.pinmapping=Pin Mapping

##############################################################

cocomake.name=CocoMake7
cocomake.upload.protocol=usbasp
cocomake.upload.maximum_size=5375
cocomake.upload.speed=19200
cocomake.upload.disable_flushing=true
cocomake.upload.tool=avrdude
cocomake.build.mcu=attiny85
cocomake.build.f_cpu=16500000L
cocomake.build.core=teenyriot-core
cocomake.build.variant=teenyriot
cocomake.build.board=AVR_COCOMAKE7
cocomake.upload.protocol=usbasp
cocomake.upload.maximum_size=5375
cocomake.upload.speed=19200
cocomake.upload.disable_flushing=true
cocomake.upload.tool=avrdude
cocomake.bootloader.low_fuses=0xE1
cocomake.bootloader.high_fuses=0x5D
cocomake.bootloader.extended_fuses=0xFE
cocomake.bootloader.file=teenyriot-usbtiny/teenyriot-usbtiny.hex
cocomake.bootloader.tool=arduino:avrdude
cocomake.core=teenyriot-core
cocomake.variant=teenyriot
